namespace YG.SC.Repository
{
    /// <summary>
    /// 接口名称：IDisposableRepository
    /// 命名空间：YG.SC.Repository
    /// 接口功能：
    /// </summary>
    /// 创建者：孟祺宙
    /// 创建日期：2014/9/15 15:32
    /// 修改者：
    /// 修改时间：
    /// ----------------------------------------------------------------------------------------
    public interface IDisposableRepository
    {
        /// <summary>
        /// 释放服务使用中的资源
        /// </summary>
        /// 创建者：孟祺宙
        /// 创建日期：2014/9/15 15:32
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        void DisposeRepository();
    }
}