
namespace YG.SC.Model
{
    /// <summary>
    /// 类名称：PagerEntity
    /// 命名空间：YG.SC.Model
    /// 类功能：
    /// </summary>
    /// 创建者：孟祺宙
    /// 创建日期：2014/9/22 15:26
    /// 修改者：
    /// 修改时间：
    /// ----------------------------------------------------------------------------------------
    public class PagerEntity
    {
        /// <summary>
        /// 总页数
        /// </summary>
        /// <value>
        /// The Total
        /// </value>
        /// 创建者：孟祺宙
        /// 创建日期：2014/9/22 15:26
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int Total { get; set; }

        /// <summary>
        /// 当前页面索引
        /// </summary>
        /// <value>
        /// The index of the page.
        /// </value>
        /// 创建者：孟祺宙
        /// 创建日期：2014/9/22 15:26
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int PageIndex { get; set; }
        /// <summary>
        /// 每页显示多少
        /// </summary>
        /// <value>
        /// The Top
        /// </value>
        /// 创建者：孟祺宙
        /// 创建日期：2014/9/22 15:26
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int Top { get; set; }

        /// <summary>
        /// 显示分页数
        /// </summary>
        /// 创建者：孟祺宙
        /// 创建日期：2014/9/22 15:27
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        private int _step;
        /// <summary>
        /// Gets or sets the Step of PagerEntity
        /// </summary>
        /// <value>
        /// The Step
        /// </value>
        /// 创建者：孟祺宙
        /// 创建日期：2014/9/22 15:27
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int Step
        {
            get
            {
                return _step == 0 ? 5 : _step;
            }
            set { _step = value; }
        }

        /// <summary>
        /// 序号从1开始 +1
        /// </summary>
        /// <value>
        /// The index.
        /// </value>
        /// 创建者：孟祺宙
        /// 创建日期：2014/9/22 14:44
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int Idx
        {
            get { return (this.PageIndex * this.Top) - this.Top + 1; }
        }
    }
}
