
namespace YG.SC.WebAPIService.Models
{
    public class AppVersionModel
    {
        /// <summary>
        /// 当前版本
        /// </summary>
        /// <value>
        /// The Version
        /// </value>
        /// 创建者：孟祺宙
        /// 创建日期：2014/10/13 13:34
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Version { get; set; }

        /// <summary>
        /// 当前版本号 目前只有安卓使用
        /// </summary>
        /// <value>
        /// The VersionCode
        /// </value>
        /// 创建者：孟祺宙
        /// 创建日期：2014/10/16 13:46
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int VersionCode { get; set; }

        /// <summary>
        /// 是否强制更新 1 强制 0 不强制
        /// </summary>
        /// <value>
        /// The IsMandatory
        /// </value>
        /// 创建者：孟祺宙
        /// 创建日期：2014/10/13 13:34
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public bool IsMandatory { get; set; }
        /// <summary>
        /// 用户地址
        /// </summary>
        /// <value>
        /// The UrlAddress
        /// </value>
        /// 创建者：孟祺宙
        /// 创建日期：2014/10/13 13:34
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string UrlAddress { get; set; }
        /// <summary>
        /// 更新内容
        /// </summary>
        /// <value>
        /// The SDesc
        /// </value>
        /// 创建者：孟祺宙
        /// 创建日期：2014/10/13 13:35
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string SDesc { get; set; }
    }
}