using System;

namespace YG.SC.WebAPIService.Models
{
    public class OrderDetailModel
    {
        /// <summary>
        /// 订单号
        /// </summary>
        /// <value>
        /// The OrderNumber
        /// </value>
        /// 创建者：边亮
        /// 创建日期：2014-09-25 17:28
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string OrderNumber { get; set; }
        /// <summary>
        /// 订单状态 
        /// </summary>
        /// <value>
        /// The OrderStatus
        /// </value>
        /// 创建者：边亮
        /// 创建日期：2014-09-25 17:29
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string OrderStatus { get; set; }
        /// <summary>
        ///订单状态名称
        /// </summary>
        /// <value>
        /// The name of the order status.
        /// </value>
        /// 创建者：边亮
        /// 创建日期：2014-09-25 17:29
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string OrderStatusName { get; set; }
        /// <summary>
        /// 订单创建时间
        /// </summary>
        /// <value>
        /// The CreateTime
        /// </value>
        /// 创建者：边亮
        /// 创建日期：2014-09-25 17:29
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public DateTime CreateTime { get; set; }
        /// <summary>
        /// 收货人姓名
        /// </summary>
        /// <value>
        /// The name of the receive.
        /// </value>
        /// 创建者：边亮
        /// 创建日期：2014-09-25 17:30
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string ReceiveName { get; set; }
        /// <summary>
        ///收货人电话
        /// </summary>
        /// <value>
        /// The ReceivePhone
        /// </value>
        /// 创建者：边亮
        /// 创建日期：2014-09-25 17:30
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string ReceivePhone { get; set; }
        /// <summary>
        /// 收货人地址
        /// </summary>
        /// <value>
        /// The ReceiveAddress
        /// </value>
        /// 创建者：边亮
        /// 创建日期：2014-09-25 17:30
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string ReceiveAddress { get; set; }
        /// <summary>
        /// 备注
        /// </summary>
        /// <value>
        /// The Remark
        /// </value>
        /// 创建者：边亮
        /// 创建日期：2014-09-25 17:31
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Remark { get; set; }
        /// <summary>
        ///订单总价
        /// </summary>
        /// <value>
        /// The TotalPrice
        /// </value>
        /// 创建者：边亮
        /// 创建日期：2014-09-25 17:31
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public decimal TotalPrice { get; set; }
        /// <summary>
        /// 配送费
        /// </summary>
        /// <value>
        /// The DliveryPrice
        /// </value>
        /// 创建者：边亮
        /// 创建日期：2014-09-25 17:31
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public decimal DeliveryPrice { get; set; }
        /// <summary>
        ///商品总价
        /// </summary>
        /// <value>
        /// The MaterialPrice
        /// </value>
        /// 创建者：边亮
        /// 创建日期：2014-09-25 17:31
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public decimal MaterialPrice { get; set; }
        /// <summary>
        /// 所有商品
        /// </summary>
        /// <value>
        /// The MaterialArray
        /// </value>
        /// 创建者：边亮
        /// 创建日期：2014-09-25 17:31
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public MaterialPart[] MaterialArray { get; set; }

        /// <summary>
        /// 发票类型：无 个人 公司
        /// </summary>
        /// <value>
        /// The Invoice
        /// </value>
        /// 创建者：孟祺宙
        /// 创建日期：2014/10/9 18:47
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Invoice { get; set; }

        /// <summary>
        /// 发票抬头
        /// </summary>
        /// <value>
        /// The Company
        /// </value>
        /// 创建者：孟祺宙
        /// 创建日期：2014/10/9 18:47
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Company { get; set; }

        /// <summary>
        /// 餐厅（scmuser中的company 用户公司）
        /// </summary>
        /// <value>
        /// The Shop
        /// </value>
        /// 创建者：边亮
        /// 创建日期：2014/11/27 15:42
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Shop { get; set; }

        /// <summary>
        ///用户备注
        /// </summary>
        /// <value>
        /// The CustomerDesc
        /// </value>
        /// 创建者：边亮
        /// 创建日期：2014/11/27 15:50
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string CustomerDesc { get; set; }

        /// <summary>
        ///客服备注
        /// </summary>
        /// <value>
        /// The FAQDesc
        /// </value>
        /// 创建者：边亮
        /// 创建日期：2014/11/27 15:51
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string FAQDesc { get; set; }
    }

    
}