
namespace YG.SC.WebAPIService.Models
{
    public class OrderAddModel
    {
        /// <summary>
        /// Gets or sets the UserToken of OrderAddModel
        /// </summary>
        /// <value>
        /// The UserToken
        /// </value>
        /// 创建者：孟祺宙
        /// 创建日期：2014/9/26 14:02
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string UserToken { get; set; }

        /// <summary>
        /// 地址id
        /// </summary>
        /// <value>
        /// The AddressId
        /// </value>
        /// 创建者：边亮
        /// 创建日期：2014-09-25 13:50
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int AddressId { get; set; }

        /// <summary>
        /// 发票类型
        /// </summary>
        /// <value>
        /// The Invoice
        /// </value>
        /// 创建者：边亮
        /// 创建日期：2014-09-25 16:14
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Invoice { get; set; }

        /// <summary>
        /// 公司发票抬头
        /// </summary>
        /// <value>
        /// The Company
        /// </value>
        /// 创建者：边亮
        /// 创建日期：2014-09-25 13:51
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Company { get; set; }

        /// <summary>
        /// Gets or sets the MaterialPart of OrderAddModel
        /// </summary>
        /// <value>
        /// The MaterialPart
        /// </value>
        /// 创建者：孟祺宙
        /// 创建日期：2014/9/26 14:02
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public MaterialPart[] MaterialPart { get; set; }

        /// <summary>
        /// 备注
        /// </summary>
        /// <value>
        /// The Remark
        /// </value>
        /// 创建者：边亮
        /// 创建日期：2014-09-25 13:52
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Remark { get; set; }
    }

 

    public  class MaterialPart
    {
        /// <summary>
        /// 商品ID
        /// </summary>
        /// 创建者：边亮
        /// 创建日期：2014-09-25 13:51
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int Id;
        /// <summary>
        /// 商品数量
        /// </summary>
        /// 创建者：边亮
        /// 创建日期：2014-09-25 13:51
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int Number;

        /// <summary>
        /// 商品名称
        /// </summary>
        /// <value>
        /// The Name
        /// </value>
        /// 创建者：边亮
        /// 创建日期：2014-09-25 17:10
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Name { get; set; }
        /// <summary>
        ///单价
        /// </summary>
        /// <value>
        /// The Price
        /// </value>
        /// 创建者：边亮
        /// 创建日期：2014-09-25 17:10
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public decimal Price { get; set; }
        /// <summary>
        /// 商品规格
        /// </summary>
        /// <value>
        /// The Specification
        /// </value>
        /// 创建者：边亮
        /// 创建日期：2014/11/3 16:35
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Specification { get; set; }
    }
}