
namespace YG.SC.WebAPIService.Models
{
    /// <summary>
    /// 类名称：UserAddressModel
    /// 命名空间：YG.SC.Model.Api
    /// 类功能：用户地址列表
    /// </summary>
    /// 创建者：孟祺宙
    /// 创建日期：2014/9/24 19:04
    /// 修改者：
    /// 修改时间：
    /// ----------------------------------------------------------------------------------------
    public class UserAddressModel
    {
        /// <summary>
        /// Gets or sets the Id of UserAddressEntity
        /// </summary>
        /// <value>
        /// The Id
        /// </value>
        /// 创建者：孟祺宙
        /// 创建日期：2014/9/24 19:04
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int Id { get; set; }
        /// <summary>
        /// 收货人姓名 
        /// </summary>
        /// <value>
        /// The Name
        /// </value>
        /// 创建者：孟祺宙
        /// 创建日期：2014/9/24 19:04
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Name { get; set; }
        /// <summary>
        /// 收货人手机号
        /// </summary>
        /// <value>
        /// The Phone
        /// </value>
        /// 创建者：孟祺宙
        /// 创建日期：2014/9/24 19:04
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Phone { get; set; }
        /// <summary>
        /// 省 id 
        /// </summary>
        /// <value>
        /// The ProvinceId
        /// </value>
        /// 创建者：孟祺宙
        /// 创建日期：2014/9/24 19:04
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int ProvinceId { get; set; }

        /// <summary>
        /// 市 id
        /// </summary>
        /// <value>
        /// The CityId
        /// </value>
        /// 创建者：孟祺宙
        /// 创建日期：2014/9/24 19:04
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int CityId { get; set; }
        /// <summary>
        /// 区、县 id 
        /// </summary>
        /// <value>
        /// The CountyId
        /// </value>
        /// 创建者：孟祺宙
        /// 创建日期：2014/9/24 19:05
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int CountyId { get; set; }
        /// <summary>
        /// 是否为默认地址 
        /// </summary>
        /// <value>
        /// The IsDefault
        /// </value>
        /// 创建者：孟祺宙
        /// 创建日期：2014/9/24 19:05
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public bool IsDefault { get; set; }

        /// <summary>
        /// 地址详情
        /// </summary>
        /// <value>
        /// The AddressDetail
        /// </value>
        /// 创建者：孟祺宙
        /// 创建日期：2014/9/26 16:32
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string AddressDetail { get; set; }

        /// <summary>
        /// 客户地址
        /// </summary>
        /// <value>
        /// The AddressFull
        /// </value>
        /// 创建者：孟祺宙
        /// 创建日期：2014/10/8 14:00
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string CustomerAddress { get; set; }
    }
}
