namespace YG.SC.Service
{
    /// <summary>
    /// 接口名称：IYgService
    /// 命名空间：YG.SC.IService
    /// 接口功能：基础 服务接口
    /// </summary>
    /// 创建者：孟祺宙
    /// 创建日期：2014/9/11 11:38
    /// 修改者：
    /// 修改时间：
    /// ----------------------------------------------------------------------------------------
    public interface IYgService
    {
        /// <summary>
        /// 释放服务使用中的资源
        /// </summary>
        /// 创建者：孟祺宙
        /// 创建日期：2014/9/11 11:38
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        void Dispose();
    }
}